/*******************************************************************************
* 文件名 : LCD1602.h
* 实现功能:LCD1602驱动程序
* 版本     作者            日期            说明
* V1.0     zhi-z          2015/08/5      初始版本

* 描述   : MCU: STC15f2k60s2     晶振: 22.1184   MHz
           
*******************************************************************************/

#ifndef __csbo_H_
#define __csbo_H_

#include "intrins.h"
#include "stc15f2k60s2.h"
#include "1602.h"

sbit Trig = P3^5;
sbit Echo = P3^4;

extern int CSB();	  //启动超声波，返回超声波测量的值


#endif