/*******************************************************************************
* 文件名 : main.c
* 实现功能:12864测试程序
* 版本     作者            日期            说明
* V1.0     zhi-z           2015/08/30       初始版本

* 描述   : MCU: STC15F2K60S2     晶振: 22.1184   MHz
           
*******************************************************************************/

#include"lcd12864.h"

byte code dis1[] = "    欢迎光临    ";
byte code dis2[] = "                ";
byte code dis3[] = "智能控制实验室  ";
byte code dis4[] = "                ";




void main()
{
	lcd_init();
	display(1,0,dis1);
	display(2,0,dis2);
	display(3,0,dis3);

	while(1);
}
