/*******************************************************************************
* 文件名 : PWM.c
* 实现功能:PWM驱动程序
* 版本     作者            日期            说明
* V1.0     zhi-z       2015/08/05       初始版本

* 描述   : MCU: STC15f2k60s2     晶振: 22.1184  MHz
			
*******************************************************************************/ 
#include "PWM.H"


/*******************************************************************************
* 功能描述 : 初始化函数
* 函数属性 : 外部
* 输入参数 : 无
* 返回参数 : 
* 函数详解 : 
*******************************************************************************/
void Init_PCA()
{
	P_SW1 = 0X20; //外设端口切换寄存器1,决定PWM信号的输出引脚,
				//这里是设置PWM模块0,模块1,模块2的输出引脚分别是P35,P36,P37
	
	CCON = 0; //PCA计数溢出表示位清零,模块0,模块1,模块2中断表示位清零,
	           //PCA运行控制位关闭
	CL = 0 ;
	CH = 0 ;
	CMOD = 0X02;//设置PCA计数脉冲源为SYSclk/2,空闲模式下继续工作,不允许中断


	
				//PWM模块0
	//--------------------------------- 
	PCA_PWM0 = 0X00;//工作在8位模式
	CCAP0H = CCAP0L = 0; //取值为0时占空比为:100%,取值为128时占空比为:50%,
	                       //取值0xff时占空比为:0%
	CCAPM0 = 0X42;	//ECOME0 = 1 使能比较器功能,PWM0 使能脉宽调节模式,
	                //即CCAPM0 = 0X42;



	
				//PWM模块1
	//---------------------------------
	PCA_PWM1 = 0X00;//工作在8位模式
	CCAP1H = CCAP1L = 0;  //取值为0时占空比为:100%,取值为128时占空比为:50%,
	                        //取值0xff时占空比为:0%
	CCAPM1 = 0X42;	//ECOME1 = 1 使能比较器功能,PWM1 使能脉宽调节模式,
	                //即CCAPM1 = 0X42;


			
				//PWM模块2
	//-------------------------------
	PCA_PWM2 = 0X00;		//工作在8位模式
	CCAP2H = CCAP2L = 128;  //取值为0时占空比为:100%,取值为128时占空比为:50%,
	                        //取值0xff时占空比为:0%
	CCAPM2 = 0X42;			//ECOME2 = 1 使能比较器功能,PWM2 使能脉宽调节模式,
	                        //即CCAPM2 = 0X42;
	//---------------------------------
	CR = 1 ;	//PCA运行控制位打开,等同于  CCON |= 0x40
}

